005_Case5/testCase/Allrun
blockMesh > log.blockMesh

decomposePar > log.decomposePar

mpirun -np 4 005_Case5 -parallel > log.mpi005_Case5

